//      Дано предложение, состоящее только из строчных латинских букв.
//        Проверьте, являются ли слова в предложении палиндромом. Выведите YES или NO.
//        Ввод: radar yes
//        Вывод: YES NO

package Task7;

public class Main {
    public static void main(String[] args) {
        String strMain = "radar yes";

        System.out.println(Task7.palindrome(strMain));
    }
}



                //доделать!!!